package com.bbk.data;

public class Holiday {
	public final static String[] lunarHoliday = new String[] { "0101 春节", "0115 元宵节",
			"0505 端午节", "0707 七夕", "0715 中元节", "0815 中秋节", "0909 重阳节", "1208 腊八节",
			"1224 小年", "0100 除夕" };

	public final static String[] solarHoliday = new String[] { "0101 元旦", "0214 情人节",
			"0308 妇女节", "0312 植树节", "0315 3.15", "0401 愚人节", "0501 劳动节",
			"0504 青年节", "0512 护士节", "0601 儿童节", "0701 建党节", "0801 建军节", "0808 父亲节",
			"0909 毛泽东逝世", "0910 教师节", "0928 孔子诞辰", "1001 国庆节", "1006 老人节",
			"1024 联合国日", "1112 孙中山诞辰", "1220 澳门回归", "1225 圣诞节", "1226 毛泽东诞辰" };
	
	public final static String[] lunarHolidayName = new String[] { "春节", "元宵节", "端午节",
			"七夕", "中元节", "中秋节", "重阳节", "腊八节", "小年", "除夕" };

	public final static String[] solarHolidayName = new String[] { "元旦",
			"0214 情人", "妇女节", "植树节", "3.15", "愚人节", "劳动节", "青年节", "护士节", "儿童节",
			"建党节", "建军节", "父亲节", "毛泽东逝世", "教师节", "孔子诞辰", "国庆节", "老人节", "联合国日",
			"孙中山诞辰", "澳门回归", "圣诞节", "毛泽东诞辰" };
}
